app/controllers/kosan_controller.rb

SELECT  "kosans".* FROM "kosans" WHERE "kosans"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @kosan = Kosan.find(params[:id])

SELECT  "kosans".* FROM "kosans" WHERE "kosans"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
UPDATE "kosans" SET "nama" = ?, "gambar" = ?, "updated_at" = ? WHERE "kosans"."id" = ?  [["nama", "kosan pak amin dua"], ["gambar", "http://www.ekompas.com/wp-content/uploads/2016/01/kos-kosan.jpg"], ["updated_at", "2017-08-17 02:20:14.853776"], ["id", 22]]
---
  def update
    @kosan = Kosan.find(params[:id])
    @kosan.update(kosan_params)

SELECT  "kosans".* FROM "kosans" WHERE "kosans"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
  def edit
    @kosan = Kosan.find(params[:id])

SELECT "kosans".* FROM "kosans"
---
  def index
    @kosans = Kosan.all

INSERT INTO "kosans" ("nama", "lokasi", "deskripsi", "harga", "gambar", "kontak", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @kosan = Kosan.new(kosan_params)
    @kosan.save

SELECT  "kosans".* FROM "kosans" WHERE "kosans"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "kosans" WHERE "kosans"."id" = ?  [["id", 7]]
---
  def destroy
    @kosan = Kosan.find(params[:id])
    @kosan.destroy